gabrieldelmonte/Scientific_Research/LAUNCHXL_F28379D/F28379D_Project/Peripheral/Source/firmware_CpuTimers.c
/*======================================================================================================================
                                                         Cpu Timers                                                     |
                                                       --------------                                                   |
FILE: firmware_CpuTimers.c                                                                                              |
                                                                                                                        |
    Baseado em:                                                                                                         |
        "CPU 32-bit Timers Initialization & Support Functions"                                                          |
        $TI Release: F2833x/F2823x Header Files and Peripheral Examples V142 $                                          |
        $Release Date: November  1, 2016 $                                                                              |
                                                                                                                        |
        $TI Release: F2837xD Support Library v210 $                                                                     |
        $Release Date: Tue Nov  1 14:46:15 CDT 2016 $                                                                   |
________________________________________________________________________________________________________________________|
                                                                                                                        |
     NOTES:   CpuTimer2 is reserved for use with DSP BIOS and other realtime operating systems.                         |
                                                                                                                        |
          Do not use these this timer in your application if you ever plan on integrating                               |
        DSP-BIOS or another realtime OS.                                                                                |
________________________________________________________________________________________________________________________|
                                                                                                                        |
                                                                                                   JO�O GABRIEL         |
                                                                                                                        |
                                                                                                    19/Julho/2022       |
=======================================================================================================================*/

#include "Peripheral/Headers/defines.h"        //  Necess�rio pela defini��o do DSP sendo usado
#include "Libraries/Headers/F2837xD_device.h"
#include "Libraries/Common/F2837xD_Examples.h"

//
// Globals
//
struct CPUTIMER_VARS CpuTimer0;
struct CPUTIMER_VARS CpuTimer1;
struct CPUTIMER_VARS CpuTimer2;

//
// InitCpuTimers - This function initializes all three CPU timers to a known
//                 state.
//
void InitCpuTimers(void)
{
    //
    // CPU Timer 0
    // Initialize address pointers to respective timer registers:
    //
    CpuTimer0.RegsAddr = &CpuTimer0Regs;

    //
    // Initialize timer period to maximum:
    //
    CpuTimer0Regs.PRD.all  = 0xFFFFFFFF;

    //
    // Initialize pre-scale counter to divide by 1 (SYSCLKOUT):
    //
    CpuTimer0Regs.TPR.all  = 0;
    CpuTimer0Regs.TPRH.all = 0;

    //
    // Make sure timer is stopped:
    //
    CpuTimer0Regs.TCR.bit.TSS = 1;

    //
    // Reload all counter register with period value:
    //
    CpuTimer0Regs.TCR.bit.TRB = 1;

    //
    // Reset interrupt counters:
    //
    CpuTimer0.InterruptCount = 0;

    //
    // Initialize address pointers to respective timer registers:
    //
    CpuTimer1.RegsAddr = &CpuTimer1Regs;
    CpuTimer2.RegsAddr = &CpuTimer2Regs;

    //
    // Initialize timer period to maximum:
    //
    CpuTimer1Regs.PRD.all  = 0xFFFFFFFF;
    CpuTimer2Regs.PRD.all  = 0xFFFFFFFF;

    //
    // Initialize pre-scale counter to divide by 1 (SYSCLKOUT):
    //
    CpuTimer1Regs.TPR.all  = 0;
    CpuTimer1Regs.TPRH.all = 0;
    CpuTimer2Regs.TPR.all  = 0;
    CpuTimer2Regs.TPRH.all = 0;

    //
    // Make sure timers are stopped:
    //
    CpuTimer1Regs.TCR.bit.TSS = 1;
    CpuTimer2Regs.TCR.bit.TSS = 1;

    //
    // Reload all counter register with period value:
    //
    CpuTimer1Regs.TCR.bit.TRB = 1;
    CpuTimer2Regs.TCR.bit.TRB = 1;

    //
    // Reset interrupt counters:
    //
    CpuTimer1.InterruptCount = 0;
    CpuTimer2.InterruptCount = 0;
}

//
// ConfigCpuTimer - This function initializes the selected timer to the period
//                  specified by the "Freq" and "Period" parameters. The "Freq"
//                  is entered as "MHz" and the period in "uSeconds". The timer
//                  is held in the stopped state after configuration.
//
void ConfigCpuTimer(struct CPUTIMER_VARS *Timer, float Freq, float Period)
{
    Uint32 temp;

    //
    // Initialize timer period:
    //
    Timer->CPUFreqInMHz = Freq;
    Timer->PeriodInUSec = Period;
    temp = (long) (Freq * Period);

    //
    // Counter decrements PRD+1 times each period
    //
    Timer->RegsAddr->PRD.all = temp - 1;

    //
    // Set pre-scale counter to divide by 1 (SYSCLKOUT):
    //
    Timer->RegsAddr->TPR.all  = 0;
    Timer->RegsAddr->TPRH.all  = 0;

    //
    // Initialize timer control register:
    //
    Timer->RegsAddr->TCR.bit.TSS = 1;     // 1 = Stop timer, 0 = Start/Restart
                                          // Timer
    Timer->RegsAddr->TCR.bit.TRB = 1;     // 1 = reload timer
    Timer->RegsAddr->TCR.bit.SOFT = 0;
    Timer->RegsAddr->TCR.bit.FREE = 0;    // Timer Free Run Disabled
    Timer->RegsAddr->TCR.bit.TIE = 1;     // 0 = Disable/ 1 = Enable Timer
                                          // Interrupt

    //
    // Reset interrupt counter:
    //
    Timer->InterruptCount = 0;
}


//---------------------------------------------------------------------------
// SetWatchdogInterruption:
//---------------------------------------------------------------------------
//      Salva na Vect Table o endere�o da interrup��o que vai ser executada quando
//    o watchdog for acionado.

//void SetTIMER_InterruptFunc(PINT function){
//
//    EALLOW;                                             //  Permite escrita em registradores protegidos
//        PieVectTable.TIMER0_INT = function;//  Seleciona fun��o 'cpu_timer0_isr' para ser executada quando a interrup��o TINT0 for chamada
//    EDIS;                                               //  Desabilita escrita em registradores protegidos
//}

//===========================================================================
// End of file.
//===========================================================================
